# -*- encoding: utf-8 -*-
"""
编译器 解释器 编辑器
    编译器：将代码文件编译成可运行文件，一般是对C语言，java来说的
    解释器：python解释器，边运行边翻译
    编辑器：pycharm、IDLE、vscode、记事本（配吗？）

数组arr 列表lst
    python的内置对象list是列表。具有非常丰富的操作
    python有内置模块array，导入后就可以使用了。数组。
    在C语言中int arr[?] = {}; 称之为数组

方法 函数
    一般类外面的def是函数
    类里的是方法

tuple的英文名
    踏破哦

报错 警告
    运行的时候解释器报错
    编写的时候编辑器给出代码高亮警告、或者运行的时候出现 warning

包，模块，库
    模块：.py文件
    模块：包含__init__.py 的文件夹
    库：范围更大，可以是一个完整的项目

迭代器 生成器
    生成器是特殊的迭代器 a = (i**3 for i in range(5))

2022年08月17日
by littlefean

"""
