"""
背景，假如你在用python开发游戏的任务系统
这个任务系统必须是无环的，否则就出bug了。
"""

# 拓扑图
# 任务id：任务信息
num2Task = {
    1: {
        "name": "开始冒险",
        "details": "前往风起之地",
    },
    2: {
        "name": "解救云隐村",
        "details": "帮助云隐村解决危机",
    },
    3: {
        "name": "破晓之星",
        "details": "追踪星银之路",
    },
    4: {
        "name": "征服风神",
        "details": "挑战风神巅峰",
    },
    5: {
        "name": "龙之末裔",
        "details": "揭开龙的秘密",
    },
}

graph = {
    1: {2, 3},
    2: {4},
    3: {4},
    4: {5},
    5: {},
}
